DeviceProcessEvents
| where InitiatingProcessFileName in~ ("vim", "vi", "vim.basic", "vim.tiny", "nano", "emacs")
| where FileName in~ ("sh", "bash", "dash", "zsh", "ksh")
| project Timestamp, DeviceId, DeviceName, ReportId, AccountName, FileName, ProcessCommandLine, InitiatingProcessFileName, InitiatingProcessCommandLine
