DeviceProcessEvents
| where FileName =~ "findstr.exe"
| where ProcessCommandLine has_any ("pass", "pwd", "password", "login", "admin", "credential")
| where ProcessCommandLine has_any ("c:\\users", "c:\\inetpub", "c:\\temp")
| project Timestamp, DeviceId, DeviceName, ReportId, AccountName, ProcessCommandLine, InitiatingProcessFileName
